Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: determine a projected pose of the HWD relative to the body reference frame, the projected pose associated with the projection time, by adjusting the estimated pose based on the total angular increment vector associated with each of the one or more rotational axes.
de_de: eine projizierte Haltung des HWD relativ zu dem Körperreferenzrahmen zu bestimmen, wobei die projizierte Haltung der Projektionszeit zugeordnet ist, durch Anpassen der geschätzten Haltung basierend auf dem gesamten Winkelinkrementvektor bei jeder der einen oder mehreren Rotationsachsen.

source: 2. The system of Claim 1, wherein the at least one processor is configured to determine the projection time by setting the projection time to a predetermined projection time.
de_de: 2. System nach Anspruch 1, wobei der mindestens eine Prozessor konfiguriert ist, um die Projektionszeit durch Einstellen der Projektionszeit auf eine vorbestimmte Projektionszeit zu bestimmen.

source: 3. The system of Claim 1 or 2, wherein the at least one processor is configured to determine the projection time by reducing the projection time when at least one of the relative angular rate or the relative angular acceleration meets or is below a minimum level.
de_de: 3. System nach Anspruch 1 oder 2, wobei der mindestens eine Prozessor konfiguriert ist, um die Projektionszeit durch Reduzieren der Projektionszeit zu bestimmen, wenn die relative Winkelrate und/oder die relative Winkelbeschleunigung einen Mindestwert erreicht oder unterschreitet.

source: 4. The system of any preceding Claim, wherein:
de_de: 4. System nach einem der vorhergehenden Ansprüche, wobei:

source: the at least one processor is configured to determine the relative angular acceleration based on N samples of the relative angular rate, wherein N is an integer greater than one;
de_de: der mindestens eine Prozessor konfiguriert ist, um die relative Winkelbeschleunigung basierend auf N Abtastwerten der relativen Winkelrate zu ermitteln, wobei N eine Ganzzahl größer als eins ist;

source: wherein determining the second angular increment vector component based on the relative angular acceleration includes filtering the relative angular acceleration based on a moving average of the N samples.
de_de: wobei das Bestimmen der zweiten Winkelinkrementvektorkomponente basierend auf der relativen Winkelbeschleunigung das Filtern der relativen Winkelbeschleunigung basierend auf einem gleitenden Durchschnitt der N Abtastwerte einschließt.

source: 5. The system of any preceding Claim, wherein the at least one processor is configured to:
de_de: 5. System nach einem der vorhergehenden Ansprüche, wobei der mindestens eine Prozessor konfiguriert ist, um:

source: receive, from an inertial measurement unit (204), IMU, of the HWD, the head-frame angular rate of motion of the head reference frame relative to the inertial reference frame;
de_de: von einer Trägheitsmesseinheit (204), IMU, des HWD die Kopfrahmen-Winkelbewegungsrate des Kopfreferenzrahmens relativ zu dem Trägheitsreferenzrahmen zu empfangen;

source: receive, from a body-mounted IMU (206), bIMU, fixed to the mobile platform, the body-frame angular rate of motion of the body reference frame relative to the inertial reference frame;
de_de: von einer körpermontierten IMU (206), bIMU, die an der mobilen Plattform fixiert ist, die Körperrahmen-Winkelbewegungsrate des Körperreferenzrahmens relativ zu dem Trägheitsreferenzrahmen zu empfangen;

source: determine the relative angular rate of motion based on the received head-frame angular rate of motion and the received body-frame angular rate of motion.
de_de: die relative Winkelbewegungsrate basierend auf der empfangenen Kopfrahmen-Winkelbewegungsrate und der empfangenen Körperrahmen-Winkelbewegungsrate zu bestimmen.

source: 6. The system of any preceding Claim, wherein the at least one processor is configured to determine the relative angular rate of motion further based on a relative angular rate of motion received from one or more optical flow sensors operatively coupled to the HWD (104).
de_de: 6. System nach einem der vorhergehenden Ansprüche, wobei der mindestens eine Prozessor konfiguriert ist, um die relative Winkelbewegungsrate ferner basierend auf einer relativen Winkelbewegungsrate zu bestimmen, die von einem oder mehreren optischen Flusssensoren empfangen wird, die mit dem HWD (104) wirkgekoppelt sind.

source: 7. A computer-assisted method (400) for predicting a future pose of a head worn display, HWD, wherein the pose comprises a position and orientation of the HWD relative to a body reference frame of a mobile platform, the method comprising:
de_de: 7. Computergestütztes Verfahren (400) zum Vorhersagen einer zukünftigen Haltung einer kopfgetragenen Anzeige (HWD), wobei die Haltung eine Position und Orientierung des HWD relativ zu einem Körperreferenzrahmen einer mobilen Plattform umfasst, das Verfahren umfassend:

source: for each of one or more rotational axes of a HWD worn on a head of a user of the mobile platform, and via a headtracker of the HWD:
de_de: für jede der einen oder mehreren Rotationsachsen eines HWD, das auf dem Kopf eines Benutzers der mobilen Plattform getragen wird, und über eine Kopfverfolgungsvorrichtung des HWD:

source: selecting (402) a relative angular rate of motion of a head reference frame relative to a body reference frame as determined based on a headframe angular rate of motion and a body-frame angular rate of motion or as determined by at least one optical flow sensor;
de_de: Auswählen (402) einer relativen Winkelbewegungsrate eines Kopfreferenzrahmens relativ zu einem Körperreferenzrahmen, wie sie basierend auf einer Kopfrahmen-Winkelbewegungsrate und einer Körperrahmen-Winkelbewegungsrate bestimmt wird oder wie sie durch mindestens einen optischen Flusssensor bestimmt wird;

source: determining (404) a relative angular acceleration of the head reference frame relative to the body reference frame by sampling the relative angular rate, the relative angular acceleration associated with a current time;
de_de: Bestimmen (404) einer relativen Winkelbeschleunigung des Kopfreferenzrahmens relativ zu dem Körperreferenzrahmen durch Abtasten der relativen Winkelrate, wobei die relative Winkelbeschleunigung einer aktuellen Zeit zugeordnet ist;

source: determining (406) a projection time relative to the current time, the projection time being a future time associated with at least one of a projected position or a projected orientation of the HWD relative to the body reference frame;
de_de: Bestimmen (406) einer Projektionszeit relativ zu der aktuellen Zeit, wobei die Projektionszeit eine zukünftige Zeit ist, die mindestens einer projizierten Position oder einer projizierten Ausrichtung des HWD relativ zu dem Körperreferenzrahmen zugeordnet ist;

source: determining (408) a first angular increment vector component based on the relative angular rate and the projection time;
de_de: Bestimmen (408) einer ersten Winkelinkrementvektorkomponente basierend auf der relativen Winkelrate und der Projektionszeit;

source: determining (410) a second angular increment vector component based on the relative angular acceleration and the projection time;
de_de: Bestimmen (410) einer zweiten Winkelinkrementvektorkomponente basierend auf der relativen Winkelbeschleunigung und der Projektionszeit;

source: determining (412) a total angular increment vector by combining the first and second angular increment vector components;
de_de: Bestimmen (412) eines gesamten Winkelinkrementvektors durch Kombinieren der ersten und zweiten Winkelinkrementvektorkomponente;

source: receiving (414), from a Kalman filter of the HWD, an estimated position and orientation (pose) of the HWD relative to the body reference frame, the estimated pose associated with the current time;
de_de: Empfangen (414) einer geschätzten Position und Orientieren (Haltung) des HWD relativ zu dem Körperreferenzrahmen von einem Kalman-Filter des HWD, wobei die geschätzte Haltung der aktuellen Zeit zugeordnet ist;

source: determining (416) a projected pose of the HWD relative to the body reference frame, the projected pose associated with the projection time, by adjusting the estimated pose based on the total angular increment vector associated with each of the one or more rotational axes.
de_de: Bestimmen (416) einer projizierten Haltung des HWD relativ zu dem Körperreferenzrahmen, wobei die projizierte Haltung der Projektionszeit zugeordnet ist, durch Anpassen der geschätzten Haltung basierend auf dem gesamten Winkelinkrementvektor bei jeder der einen oder mehreren Rotationsachsen.

source: 8. The method of Claim 7, wherein the projection time is a predetermined projection time.
de_de: 8. Verfahren nach Anspruch 7, wobei die Projektionszeit eine vorbestimmte Projektionszeit ist.

source: 9. The method of Claim 7 or 8, wherein determining the projection time relative to the current time includes:
de_de: 9. Verfahren nach Anspruch 7 oder 8, wobei das Bestimmen der Projektionszeit relativ zu der aktuellen Zeit einschließt:

source: reducing the projection time when at least one of the relative angular rate or the relative angular acceleration meets or is below a minimum level.
de_de: Reduzieren der Projektionszeit, wenn die relative Winkelrate und/oder die relative Winkelbeschleunigung einen Mindestwert erreicht oder unterschreitet.

source: The method of any of Claims 7 to 9, wherein:
de_de: Verfahren nach einem der Ansprüche 7 bis 9, wobei:

source: determining a relative angular acceleration of the body reference frame relative to the head reference frame by sampling the relative angular rate includes determining a relative angular acceleration based on N samples of the relative angular rate, wherein N is an integer greater than one;
de_de: ein Bestimmen einer relativen Winkelbeschleunigung des Körperreferenzrahmens relativ zu dem Kopfreferenzrahmen durch Abtasten der relativen Winkelrate das Bestimmen einer relativen Winkelbeschleunigung basierend auf N Abtastwerten der relativen Winkelrate einschließt, wobei N eine Ganzzahl größer als eins ist;

source: wherein determining a second angular increment vector component based on the relative angular acceleration includes filtering the relative angular acceleration based on a moving average of the N samples.
de_de: wobei ein Bestimmen einer zweiten Winkelinkrementvektorkomponente basierend auf der relativen Winkelbeschleunigung das Filtern der relativen Winkelbeschleunigung basierend auf einem gleitenden Durchschnitt der N Abtastwerte einschließt.

source: The method of any of Claims 7 to 10, wherein selecting a relative angular rate of motion of a head reference frame relative to a body reference frame includes:
de_de: Verfahren nach einem der Ansprüche 7 bis 10, wobei das Auswählen einer relativen Winkelbewegungsrate eines Kopfreferenzrahmens relativ zu einem Körperreferenzrahmen Folgendes einschließt:

source: receiving the head-frame angular rate of motion of the head reference frame relative to an inertial frame from a head-mounted inertial measurement unit (IMU, hIMU) of the HWD;
de_de: Empfangen der Kopfrahmen-Winkelbewegungsrate des Kopfreferenzrahmens relativ zu einem Trägheitsrahmen von einer kopfmontierten Trägheitsmesseinheit (IMU, hIMU) des HWD;

source: receiving the body-frame angular rate of motion of the body reference frame relative to the inertial frame from a body-mounted IMU (bIMU) fixed to the mobile platform;
de_de: Empfangen der Körperrahmen-Winkelbewegungsrate des Körperreferenzrahmens relativ zu dem Trägheitsrahmen von einer körpermontierten IMU, bIMU, die an der mobilen Plattform fixiert ist;

source: determining the relative angular rate of motion based on the received headframe angular rate of motion and the received body-frame angular rate of motion.
de_de: Bestimmen der relativen Winkelbewegungsrate basierend auf der empfangenen Kopfrahmen-Winkelbewegungsrate und der empfangenen Körperrahmen-Winkelbewegungsrate.

source: The method of any of Claims 7 to 11, wherein selecting a relative angular rate of motion of a head reference frame relative to a body reference frame includes:
de_de: Verfahren nach einem der Ansprüche 7 bis 11, wobei das Auswählen einer relativen Winkelbewegungsrate eines Kopfreferenzrahmens relativ zu einem Körperreferenzrahmen Folgendes einschließt:

source: receiving the relative angular rate of motion via the at least one optical flow sensor of the HWD.
de_de: Empfangen der relativen Winkelbewegungsrate über den mindestens einen optischen Flusssensor des HWD.

source: 1. A computer-implemented method for testing a propeller feathering function, the method comprising:
de_de: 1. Computerimplementiertes Verfahren zum Testen einer Propellersegelstellungsfunktion, das Verfahren umfassend:

source: monitoring over time, by a processor (504) of a computing device, a torque applied to a rotor shaft assembly (24) operatively connected to a propeller (30) of an aircraft;
de_de: Überwachen eines Drehmoments im Zeitverlauf durch einen Prozessor (504) einer Computervorrichtung, das auf eine Rotorwellenbaugruppe (24) ausgeübt wird, die betriebsmäßig mit einem Propeller (30) eines Flugzeugs verbunden ist;

source: commanding, by the processor (504) of the computing device, an angle change of propeller blades of the propeller (30) in response to receipt, at the processor (504), of a trigger signal generated upon initiation of a task or procedure, such as an engine shutdown, performed within the aircraft;
de_de: Befehlen einer Winkeländerung der Propellerblätter des Propellers (30) durch den Prozessor (504) der Computervorrichtung als Reaktion auf den Empfang eines Auslösesignals bei dem Prozessor (504), das beim Initiieren einer Aufgabe oder eines Verfahrens, wie beispielsweise einer Motorabschaltung, die in dem Flugzeug durchgeführt wird, erzeugt wird;

source: comparing, by the processor (504) of the computing device and in response to the angle change being commanded, a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque without the commanded angle change and obtaining, by the processor (504), a torque difference; and
de_de: Vergleichen eines nach der Winkeländerung auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments mit einem erwarteten Drehmoment ohne die befohlene Winkeländerung durch den Prozessor (504) der Computervorrichtung und als Reaktion auf die befohlene Winkeländerung und Erlangen einer Drehmomentdifferenz durch den Prozessor (504); und

source: issuing, by the processor (504) of the computing device, a test passed signal when the torque difference exceeds a threshold and a test failed signal when the torque difference does not exceed the threshold.
de_de: Ausgeben eines Signals „Test bestanden“ durch den Prozessor (504) der Computervorrichtung, wenn die Drehmomentdifferenz einen Schwellenwert überschreitet, und eines Signals „Test fehlgeschlagen“, wenn die Drehmomentdifferenz den Schwellenwert nicht überschreitet.

source: 2. The method of claim 1, wherein monitoring the torque over time comprises monitoring a rate of change of the torque over time.
de_de: 2. Verfahren nach Anspruch 1, wobei Überwachen des Drehmoments im Zeitverlauf Überwachen einer Änderungsrate des Drehmoments im Zeitverlauf umfasst.

source: 3. The method of claim 2, wherein comparing a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque comprises comparing the rate of change of the torque applied to the rotor shaft assembly (24) to an expected rate of change of a zero pitch angle propeller.
de_de: 3. Verfahren nach Anspruch 2, wobei Vergleichen eines auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments nach einer Winkeländerung mit einem erwarteten Drehmoment Vergleichen der Änderungsrate des auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments mit einer erwarteten Änderungsrate eines Propellers mit Nullsteigungswinkel umfasst.

source: 4. The method of any preceding claim, further comprising detecting an aircraft-on-ground condition, and wherein commanding an angle change of the propeller blades comprises commanding the angle change only when the aircraft-on-ground condition is detected.
de_de: 4. Verfahren nach einem der vorhergehenden Ansprüche, ferner umfassend Detektieren eines Zustands „Flugzeug am Boden“, und wobei Befehlen einer Winkeländerung der Propellerblätter nur dann Befehlen der Winkeländerung umfasst, wenn der Zustand „Flugzeug am Boden“ detektiert wird.

source: 5. The method of any preceding claim, wherein monitoring torque over time comprises monitoring one of:
de_de: 5. Verfahren nach einem der vorhergehenden Ansprüche, wobei Überwachen des Drehmoments im Zeitverlauf Überwachen eines der folgenden Elemente umfasst:

source: a spacing between teeth of the rotor shaft assembly (24); or
de_de: eines Abstands zwischen den Zähnen der Rotorwellenbaugruppe (24); oder

source: a hydraulic pressure of a hydraulic pressure reaction assembly (34) operatively connected to the rotor shaft assembly (24).
de_de: eines Hydraulikdrucks einer Hydraulikdruckreaktionsbaugruppe (34), die betriebsmäßig mit der Rotorwellenbaugruppe (24) verbunden ist.

source: 6. The method of any preceding claim, wherein commanding an angle change of the propeller blades comprises commanding an angle change to a target blade pitch that is less than a maximum blade pitch.
de_de: 6. Verfahren nach einem der vorhergehenden Ansprüche, wobei Befehlen einer Winkeländerung der Propellerblätter Befehlen einer Winkeländerung bis auf eine Sollblattsteigung umfasst, die kleiner als eine maximale Blattsteigung ist.

source: 7. The method of any preceding claim, wherein commanding an angle change of the propeller blades comprises progressively changing a pitch of the propeller blades until a target blade pitch is reached.
de_de: 7. Verfahren nach einem der vorhergehenden Ansprüche, wobei Befehlen einer Winkeländerung der Propellerblätter schrittweises Ändern einer Steigung der Propellerblätter umfasst, bis eine Sollsteigung der Blätter erreicht ist.

source: 8. The method of claim 7, wherein comparing a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque comprises comparing until a first one of reaching the target blade pitch and obtaining the torque difference that exceeds the threshold occurs.
de_de: 8. Verfahren nach Anspruch 7, wobei Vergleichen eines nach der Winkeländerung auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments mit einem erwarteten Drehmoment Vergleichen umfasst, bis entweder der Sollblattwinkel erreicht ist oder eine Drehmomentdifferenz erreicht ist, die den Schwellenwert überschreitet.

source: 9. The method of any preceding claim, wherein comparing a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque comprises comparing a rotational speed of the propeller (30) to a threshold rotational speed, and determining whether the rotational speed of the propeller (30) is above the threshold rotational speed.
de_de: 9. Verfahren nach einem der vorhergehenden Ansprüche, wobei Vergleichen eines auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments nach der Winkeländerung mit einem erwarteten Drehmoment Vergleichen einer Drehzahl des Propellers (30) mit einer Schwellenwertdrehzahl und Bestimmen, ob die Drehzahl des Propellers (30) über der Schwellenwertdrehzahl ist, umfasst.

source: A system (204) for testing a propeller feathering function, the system (204) comprising:
de_de: System (204) zum Testen einer Propellersegelstellungsfunktion, das System (204) umfassend:

source: a memory (502);
de_de: einen Speicher (502);

source: a processor (504) coupled to the memory (502); and
de_de: einen Prozessor (504), der mit dem Speicher (502) gekoppelt ist; und

source: an application (506a) stored in the memory (502) and comprising program code executable by the processor (504) for:
de_de: eine Anwendung (506a), die in dem Speicher (502) gespeichert ist und Programmcode umfasst, der von dem Prozessor (504) ausführbar ist zum:

source: monitoring over time a torque applied to a rotor shaft assembly (24) operatively connected to a propeller (30) of an aircraft;
de_de: Überwachen eines Drehmoments im Zeitverlauf, das auf eine Rotorwellenbaugruppe (24) ausgeübt wird, die betriebsmäßig mit einem Propeller (30) eines Flugzeugs verbunden ist;

source: commanding an angle change of propeller blades of the propeller (30) in response to receipt of a trigger signal generated upon initiation of a task or procedure, such as an engine shutdown, performed within the aircraft;
de_de: Befehlen einer Winkeländerung der Propellerblätter des Propellers (30) als Reaktion auf den Empfang eines Auslösesignals, das beim Initiieren einer Aufgabe oder eines Verfahrens, wie beispielsweise einer Motorabschaltung, die in dem Flugzeug durchgeführt wird, erzeugt wird;

source: comparing, in response to the angle change being commanded, a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque without the commanded angle change and obtaining a torque difference; and
de_de: Vergleichen eines nach der Winkeländerung auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments mit einem erwarteten Drehmoment ohne die befohlene Winkeländerung als Reaktion auf die befohlene Winkeländerung und Erlangen einer Drehmomentdifferenz; und

source: issuing a test passed signal when the torque difference exceeds a threshold and a test failed signal when the torque difference does not exceed the threshold.
de_de: Ausgeben eines Signals „Test bestanden“, wenn die Drehmomentdifferenz einen Schwellenwert überschreitet, und eines Signals „Test fehlgeschlagen“, wenn die Drehmomentdifferenz den Schwellenwert nicht überschreitet.

source: The system (204) of claim 10, wherein monitoring the torque over time comprises monitoring a rate of change of the torque over time.
de_de: System (204) nach Anspruch 10, wobei Überwachen des Drehmoments im Zeitverlauf Überwachen einer Änderungsrate des Drehmoments im Zeitverlauf umfasst.

source: The system (204) of claim 11, wherein comparing a post-angle change torque applied to the rotor shaft assembly (24) to an expected torque comprises comparing the rate of change of the torque applied to the rotor shaft assembly (24) to an expected rate of change of a zero pitch angle propeller.
de_de: System (204) nach Anspruch 11, wobei Vergleichen eines auf die Rotorwellenbaugruppe (24) ausgeübten Drehmoments nach einer Winkeländerung mit einem erwarteten Drehmoment Vergleichen der Änderungsrate des auf die Rotorwellenaugruppe (24) ausgeübten Drehmoments mit einer erwarteten Änderungsrate eines Propellers mit Nullsteigungswinkel umfasst.

source: The system (204) of claim 10, 11 or 12, further comprising detecting an aircraft-on-ground condition, and wherein commanding an angle change of the propeller blades comprises commanding the angle change only when the aircraft-on-ground condition is detected.
de_de: System (204) nach Anspruch 10, 11 oder 12, ferner umfassend Detektieren eines Zustands „Flugzeug am Boden“, und wobei Befehlen einer Winkeländerung der Propellerblätter nur dann Befehlen der Winkeländerung umfasst, wenn der Zustand „Flugzeug am Boden“ detektiert wird.

source: The system (204) of any of claims 10 to 13, further comprising returning the propeller blades to a zero pitch angle after issuing the test passed signal.
de_de: System (204) nach einem der Ansprüche 10 bis 13, ferner umfassend Zurückführen der Propellerblätter auf einen Nullsteigungswinkel nach Ausgeben des Signals „Test bestanden“.
